app/views/articles/_show_article.html.erb

    <span class="date"> <%= time_ago_in_words(article.created_at) %> ago </span>
    <span class="comments"><%= link_to article.comments.count.to_s + " comments", article_path(article)%><span>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]