app/views/articles/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 8]]
---
    <div class="comments">
      <%= link_to article.comments.count.to_s + " comments", article_path(article) %>