app/controllers/articles_controller.rb

 def index
    @articles = Article.order("created_at DESC")
---
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC

  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?