app/controllers/static_pages_controller.rb

  def home
    @article = Article.last
---
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 1